tutorials/case_sheet/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    (-0.02 -0.02 -0.02)
    ( 0.02 -0.02 -0.02)
    ( 0.02  0.02 -0.02)
    (-0.02  0.02 -0.02)
    (-0.02 -0.02  0.02)
    ( 0.02 -0.02  0.02)
    ( 0.02  0.02  0.02)
    (-0.02  0.02  0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (21 21 21) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (2 3 6 7)
        );
    }


    outlet
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }



    wall
    {
        type wall;
        faces
        (
            (4 7 3 0)
             (5 1 2 6)
             (0 1 2 3)
             (4 5 6 7)
        );
    }





);

mergePatchPairs
(
);

// ************************************************************************* //
